
Orion t^2 project based on Rubin's 2012 WFC3 data

* Revisiting this project [2013-08-04 Sun]

+ Main aim is to assess whether we can measure t^2([N II]) or not.
+ First task is to accurately measure the 5755/6584 ratio
  + The main problem is that the 5755 line only contributes about 10% to the FQ575N filter.  The remainder is continuum.  So that continuum needs to be measured and subtracted very accurately.
  + Secondary problem is extinction
+ Second task is to find T([N II]) and t^2 from the 5755/6584 ratio
  + Bob has some of the complications described in [[file:record]]
  + Circular dependence of reddening on T via intrinsic Hb/Ha ratio
  + Dependence of T(N II) on density:
    + t(NII)=2.5/{longRNII - 2.108 + [1 + 4.4E-5Ne/t^1/2]}
    + Density varies from 1000 to 6000 cm^{-3}
      |    n |           |
      |------+-----------|
      | 1000 | 1.0429058 |
      | 6000 | 1.2574349 |
      #+TBLFM: $2=1 + 4.5e-5 $1 / sqrt(1.1)



* The [N II] temperature map

The main issue here is the correction for the underlying continuum. 

+ In the Ring Nebula EW(Hb) = 800 Angstrom and is roughly constant in the inner region (drops at the outside, where dust scattering becomes important)
+ In Orion, the EW is smaller: roughly 400 Angstrom in the inner regions, but varying strongly with position
+ From O'Dell & Harris we have spectrophotometry
  + The relevant regions are the western portions of slits 11 and 12
  + 

|          |  11-west |  12-west |
|----------+----------+----------|
| c(Hb)    |     0.26 |     0.37 |
| S(Hb)    | 3.25E−13 | 3.93E−13 |
| EW(Hb)   |      380 |      400 |
| NII 5755 |   0.0039 |   0.0032 |
| NII 6584 |   0.3792 |   0.2964 |
| EW(5755) |    1.482 |     1.28 |
| EW(6584) |  144.096 |   118.56 |
#+TBLFM: @7$2..@8$3=@-2 @4
 

*** Useful continuum filters

Which lines are in which filters?

| Name   | Description    | Pivot λp (nm) | Width (nm) | Peak System Throughput |  lam_1 |  lam_2 |
| 1      | 2              |             3 |          4 |                        |        |        |
|--------+----------------+---------------+------------+------------------------+--------+--------|
| F467M  | Strömgren b    |         468.3 |       20.1 |                   0.28 | 4582.5 | 4783.5 |
| F547M  | Strömgren y    |         544.7 |       65.0 |                   0.26 | 5122.0 | 5772.0 |
| FQ634N | 6194 continuum |         634.9 |        6.4 |                   0.26 | 6317.0 | 6381.0 |
| F645N  | Continuum      |         645.4 |        8.4 |                   0.25 | 6412.0 | 6496.0 |
#+TBLFM: $6=10 ($3 - 0.5 $4) ; f1::$7=10 ($3 + 0.5 $4) ; f1

**** F467M Strömgren b 4582-4783 (W=201 A)

+ This is 4 times broader than F469N, which helps to dilute the lines.
+ But, the sum of the lines are 3 times higher flux!
  + So we don't gain much
  + The majority are He I and [Fe III]

|----------+----------+----------+---+------+----+--------+--------+-------+---------------------------------------------------------------------|
| 4571.200 | 4571.096 | Mg I     |   |  6.9 | 19 | 0.0014 | 0.0021 |   7.4 | the strongest semiforbidden optical line                            |
| 4590.972 | 4590.974 | O II     |   | -0.2 | 13 | 0.0040 | 0.0059 |  27.2 |                                                                     |
| 4596.175 | 4596.177 | O II     |   | -0.1 | 14 | 0.0032 | 0.0047 |  21.3 |                                                                     |
| 4597.048 |  4596.84 | [Ni III] |   | 13.6 | 18 | 0.0019 | 0.0028 |  10.5 |                                                                     |
| 4601.472 | 4601.478 | N II     |   | -0.4 | 15 | 0.0025 | 0.0037 |  15.9 |                                                                     |
| 4602.080 | 4602.129 | O II     |   | -3.2 | 20 | 0.0015 | 0.0022 |   7.5 |                                                                     |
| 4607.114 |  4607.03 | [Fe III] |   |      | 14 | 0.0094 | 0.0138 |  57.1 |                                                                     |
|          | 4607.153 | N II     |   |      |    |        |        |       |                                                                     |
| 4609.440 | 4609.436 | O II     |   |  0.3 | 19 | 0.0023 | 0.0034 |   9.9 |                                                                     |
| 4613.848 | 4613.868 | N II     | ? | -1.3 |  9 | 0.0015 | 0.0022 |   8.2 | average; anomalously low FWHM                                       |
| 4621.355 | 4621.418 | Si II    |   |      | 21 | 0.0030 | 0.0044 |   7.3 | average                                                             |
|          | 4621.696 | Si II    |   |      |    |        |        |       | observed line might include Si II triplet                           |
|          | 4621.722 | Si II    |   |      |    |        |        |       |                                                                     |
|          | 4621.570 | [C I]    |   |      |    |        |        |       |                                                                     |
|          | 4621.393 | N II     |   |      |    |        |        |       | main contributor                                                    |
| 4628.294 | 4628.046 | [Ni II]  | ? | 16.1 |  9 | 0.0008 | 0.0012 |   4.7 | anomalously low FWHM                                                |
| 4630.536 | 4630.539 | N II     |   |      | 14 | 0.0076 | 0.0111 |  37.2 |                                                                     |
|          |  4630.61 | N III    |   |      |    |        |        |       |                                                                     |
| 4634.072 |  4634.13 | N III    | ? | -3.8 | 13 | 0.0008 | 0.0012 |   5.2 | from multiplet with strongest line at 4640.64                       |
| 4638.841 | 4638.856 | O II     |   | -0.9 | 14 | 0.0083 | 0.0121 |  53.9 |                                                                     |
| 4640.569 |  4640.64 | N III    |   | -4.6 | 13 | 0.0013 | 0.0019 |   9.0 | from multiplet with strongest line at 4640.64                       |
| 4641.806 | 4641.810 | O II     |   | -0.3 | 14 | 0.0166 | 0.0241 | 109.0 |                                                                     |
| 4643.086 | 4643.086 | N II     |   |  0.0 | 15 | 0.0037 | 0.0054 |  22.5 |                                                                     |
| 4649.133 | 4649.135 | O II     |   | -0.1 | 14 | 0.0266 | 0.0386 | 171.5 | this is the strongest line of the multiplet; all lines are observed |
| 4650.827 | 4650.838 | O II     |   | -0.7 | 13 | 0.0081 | 0.0117 |  54.9 |                                                                     |
| 4658.149 |  4658.05 | [Fe III] |   |  6.4 | 15 | 0.1246 | 0.1804 | 844.6 |                                                                     |
| 4661.621 | 4661.632 | O II     |   | -0.7 | 14 | 0.0091 | 0.0132 |  67.4 |                                                                     |
| 4667.047 |  4667.01 | [Fe III] |   |  2.4 | 16 | 0.0050 | 0.0072 |  35.9 |                                                                     |
| 4673.720 | 4673.733 | O II     |   | -0.8 | 13 | 0.0014 | 0.0020 |  11.5 |                                                                     |
| 4676.224 | 4676.235 | O II     |   | -0.7 | 16 | 0.0060 | 0.0087 |  43.5 | cosmic ray hit on wing                                              |
| 4696.317 | 4696.353 | O II     | ? | -2.3 | 15 | 0.0011 | 0.0016 |   5.9 | weakest line from multiplet 4649.135                                |
| 4699.167 | 4699.011 | O II     |   |      | 23 | 0.0022 | 0.0032 |   7.5 |                                                                     |
|          | 4699.218 | O II     |   |      |    |        |        |       |                                                                     |
| 4701.603 |  4701.53 | [Fe III] |   |  4.6 | 14 | 0.0390 | 0.0559 | 188.8 |                                                                     |
| 4705.358 | 4705.346 | O II     |   |  0.8 | 13 | 0.0030 | 0.0043 |  14.2 |                                                                     |
| 4711.331 |  4711.37 | [Ar IV]  |   | -2.5 | 13 | 0.0109 | 0.0156 |  38.9 | average                                                             |
| 4713.164 | 4713.139 | He I     |   |  1.5 | 19 | 0.1340 | 0.1916 | 354.3 | average                                                             |
| 4728.294 | 4728.068 | [Fe II]  | ? | 14.3 | 14 | 0.0011 | 0.0016 |   7.0 | possible line from multiplet with 4889.617                          |
| 4733.937 |  4733.91 | [Fe III] |   |  1.7 | 15 | 0.0166 | 0.0236 | 100.8 |                                                                     |
| 4740.188 |  4740.17 | [Ar IV]  |   |  1.1 | 13 | 0.0125 | 0.0178 |  92.5 |                                                                     |
| 4752.953 | 4752.691 | O II     | ? | 16.5 | 22 | 0.0016 | 0.0023 |   8.1 |                                                                     |
| 4754.776 |  4754.69 | [Fe III] |   |  5.4 | 15 | 0.0232 | 0.0329 | 161.6 |                                                                     |
| 4756.469 |          |          | ? |      | 21 | 0.0021 | 0.0030 |  11.1 |                                                                     |
| 4762.400 |          |          | ? |      | 21 | 0.0010 | 0.0014 |   5.6 |                                                                     |
| 4769.496 |  4769.43 | [Fe III] |   |  4.2 | 15 | 0.0136 | 0.0192 |  88.4 |                                                                     |
| 4774.942 | 4774.718 | [Fe II]  |   | 14.1 | 13 | 0.0012 | 0.0017 |   8.3 | from multiplet with strongest line at 4814.534                      |
| 4777.734 |  4777.68 | [Fe III] |   |  3.4 | 14 | 0.0080 | 0.0113 |  53.4 |                                                                     |
| 4779.715 | 4779.722 | N II     |   | -0.4 | 14 | 0.0014 | 0.0020 |   9.6 |                                                                     |
| 4788.139 | 4788.138 | N II     |   |  0.0 | 17 | 0.0020 | 0.0028 |  12.1 |                                                                     |
| 4789.611 |  4789.45 | [F II]   | ? | 10.1 | 16 | 0.0009 | 0.0013 |   5.3 |                                                                     |
| 4792.073 | 4792.007 | S II     | ? |  4.2 | 23 | 0.0010 | 0.0014 |   4.3 |                                                                     |
| 4793.839 | 4793.648 | N II     | ? | 12.0 | 25 | 0.0019 | 0.0027 |   7.7 | several lines of this multiplet are observed                        |
| 4802.489 |          |          | ? |      | 15 | 0.0017 | 0.0024 |   8.6 |                                                                     |
| 4803.267 | 4803.287 | N II     |   | -1.2 | 12 | 0.0023 | 0.0032 |  13.2 | the same multiplet as 4774, 4779, 4781, 4788, 4793, 4810            |
| 4814.741 | 4814.534 | [Fe II]  |   | 12.9 | 18 | 0.0086 | 0.0120 |  28.5 | average; from multiplet with strongest line at 4814.534             |
| 4815.563 | 4815.617 | N II     |   |      | 17 | 0.0030 | 0.0042 |  10.3 | average                                                             |
|          | 4815.552 | S II     |   |      |    | 0.0024 |        |       |                                                                     |
|----------+----------+----------+---+------+----+--------+--------+-------+---------------------------------------------------------------------|
|          |          |          |   |      |    |        |  0.783 |       |                                                                     |
     #+TBLFM: @58$8=vsum(@I..@II)

*** Just the filters we use

Bob says in the Ring paper...

: We adopted the pre-launch determined values of W from Table 6.2 of the
: WFC3 Instrument Handbook, except increasing the values slightly
: because of the broadening due to short wavelength shift of the filter
: profile. The amount of the shift was guided by the determination from
: emission-lines falling on the short wavelength portion of the filter
: profile described below. The adopted values of W were FQ436N (4.5 nm),
: FQ437N (3.3 nm), F469N (5.31 nm), F487N (6.2 nm), FQ575N (2.06 nm),
: FQ672N (2.21 nm), F673N (12.31 nm), and FQ674N (2.11 nm). It was not
: necessary to adopt a value of W for F502N, F656N, and F658N because
: the observed continuum was so weak that the continuum correction was
: less than 0.01).

Which gives ...

| Name   | Description      | Pivot λp (nm) | Width (nm) | Peak System Throughput | EW (Ang) | EW/EW547 | W/W547 |
| 1      | 2                |             3 |          4 |                      5 |        6 |        7 |      8 |
|--------+------------------+---------------+------------+------------------------+----------+----------+--------|
| FQ437N | [O III] 4363     |         437.1 |       3.30 |                   0.20 |      6.6 |   0.0391 | 0.0508 |
| F469N  | He II 4686       |         468.8 |       5.31 |                   0.20 |     10.6 |   0.0627 | 0.0817 |
| F487N  | Hβ 4861          |         487.1 |       6.20 |                   0.25 |     15.5 |   0.0917 | 0.0954 |
| F502N  | [O III] 5007     |         501.0 |       6.50 |                   0.26 |     16.9 |   0.1000 | 0.1000 |
| F547M  | Strömgren y      |         544.7 |      65.00 |                   0.26 |    169.0 |   1.0000 | 1.0000 |
| FQ575N | [N II] 5754      |         575.8 |       2.06 |                   0.23 |      4.7 |   0.0278 | 0.0317 |
| F656N  | Hα 6562          |         656.1 |       1.80 |                   0.24 |      4.3 |   0.0254 | 0.0277 |
| F658N  | [N II] 6583      |         658.4 |       2.80 |                   0.26 |      7.3 |   0.0432 | 0.0431 |
| FQ672N | [S II] 6717      |         671.6 |       2.21 |                   0.25 |      5.5 |   0.0325 | 0.0340 |
| F673N  | [S II] 6717/6731 |         676.6 |      12.31 |                   0.25 |     30.8 |   0.1822 | 0.1894 |
| FQ674N | [S II] 6731      |         673.1 |       2.11 |                   0.19 |      4.0 |   0.0237 | 0.0325 |
#+TBLFM: $6=10 $-1 $-2; f1::$7=$-1/@7$-1; f4::$8=$4/@7$4;f4

+ For the most part, the transmission profiles are very square, but F547M has a significant slope: from 0.26 at 525 nm to 0.19 at 580 nm.
  + This does not affect the nominal width, which is EW/peak
  + But it means that there will be a color term in the filter sensitivity
  + Variation is about 20%


